app/views/posts/show.html.erb

      <p><strong>현재 신청자 현황</strong></p>
      <% @comments = @post.comments.all.reverse %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]