app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["post_id", 1], ["created_at", "2018-08-16 10:26:18.086157"], ["updated_at", "2018-08-16 10:26:18.086157"]]
---
    def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new
    @comment.comment = params[:comment]
    @comment.user_id = params[:user_id]
    @comment.save