app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
---
  def index
    #@posts = Post.all
    #게시판 페이지 목록 범위 설정 -> 2개씩 보여주기<테스트 버전>
    #@posts = Post.paginate(:page => params[:page], :per_page => 2)
    #최신글이 맨위로 노출되게 해준다. -> 목록에 2개씩 보여주기
    @posts = Post.order("created_at DESC").paginate(:page => params[:page], :per_page => 4)

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "테스트"], ["content", "테스트12"], ["user_id", 3], ["created_at", "2018-08-16 10:26:10.500161"], ["updated_at", "2018-08-16 10:26:10.500161"]]
---
  def create
    @post = Post.new(post_params)
    @post.user_id = current_user.id

    respond_to do |format|
      if @post.save